# Программа должна считать количество смайликов определённого вида
# (вид смайлика описан в таблице вариантов) в предложенном тексте.
# str = '[<{\'
import re

print('1Часть Вариант №', 367511 % 6, 367511 % 4, 367511 % 7, sep='')
first_test1 = '[<{\\[<{\\[<{\\'
first_test2 = '\\@[orЁl[<<{day{[<{\\'
first_test3 = '[<{\\\\\\\\[<{{{{\\[<<<[<{\\'
first_test4 = '[<{\\[<{\\[<{\\[<{\\[<{\\[<{\\[<{\\[<{\\[<{\\[<{\\'
first_test5 = '[<{\[<{\[<{\[<{\[<{\[<{\[<{\[<{\[<{\\[<{\\'
str = '[<{\\'
print("Примеры\n1)Cтрока " + str + " содержится в строке " + first_test1, " ", len(re.findall(r"\[<{\\", first_test1)),
      " раза\n", "2)Cтрока " + str + " содержится в строке " + first_test2, " ",
      len(re.findall(r"\[<{\\", first_test2)), " раз\n", "3)Cтрока " + str + " содержится в строке " + first_test3, " ",
      len(re.findall(r"\[<{\\", first_test3)), " раза\n", "4)Cтрока " + str + " содержится в строке " + first_test4,
      " ", len(re.findall(r"\[<{\\", first_test4)), " раз\n", "5)Cтрока " + str + " содержится в строке " + first_test5,
      " ", len(re.findall(r"\[<{\\", first_test5)), " раз", sep='')

input()
print('Если хотите задать программе свои примеры, сейчас самое время:')
while True:
    s = input()
    print(len(re.findall(r"\[<{\\", s)))
    if s == '':
        break
    print("Следующий тест:")
